org/0_overview_practice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-19 Fri 08:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Course Overview Practice Assignment: First C Program</title>
<meta name="author" content="Marcus Birkenkrahe" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Course Overview Practice Assignment: First C Program
<br />
<span class="subtitle">Introduction to Programming - Spring 2023 - Lyon College</span>
</h1>
<div id="outline-container-orgb762b35" class="outline-2">
<h2 id="orgb762b35">Practice: first C program! (15 min)</h2>
<div class="outline-text-2" id="text-orgb762b35">
<p>
Let's set emacs up, write and run a first "literate" c program! it is
very important that you enter everything <b>exactly as shown</b>. if you get
something wrong just go back one step. Contact me if you need me after
checking with your neighbor if he or she can help.
</p>

<ol class="org-ol">
<li>Open the command line terminal with <code>cmd</code> in the search field and pin
the app to the task bar to open it more quickly next time.</li>

<li>At the prompt, type <code>gcc --version</code> - this should tell you the
location of the C compiler, GNU CC.</li>

<li>Open the Windows search field and type <code>notepad</code>, then open the
app. You can also pin it to the taskbar. This is your editor now.</li>

<li>Pin the terminal to your taskbar to open it quickly next time!</li>

<li><p>
In the <code>notepad</code> app window, enter the following lines - don't miss
a single character, including empty 'whitespace':
</p>
<pre class="example" id="org971fd41">
#include &lt;stdio.h&gt;

int main (void)
{
   puts("Hello, world!");
   return 0;
}
</pre></li>

<li>Save the file with <code>CTRL + s</code> to the name: <code>hello.c</code>. Pay attention to
the file location on your computer, e.g. <code>This PC &gt; Downloads</code>.</li>

<li>Close the <code>notepad</code> app.</li>

<li>Open the CMD line terminal again.</li>

<li>Go to the location of your <code>hello.c</code> file by entering <code>cd</code> followed by
the location, e.g. <code>cd Downloads</code> or <code>cd C:\</code>.</li>

<li>Make sure your file is there and ready by entering <code>type
    hello.c</code>. You should now see it on the screen.</li>

<li>Compile the program by entering <code>gcc hello.c</code>. If all is well,
you'll get no response, just another prompt.</li>

<li>At the prompt, enter <code>DIR hello.c a.exe</code> - this will give you
information about your C file and the executable machine file.</li>

<li>Run the program by entering <code>a.exe</code>.</li>

<li>Now compile the program again with the command <code>gcc hello.c -o hello</code>.</li>

<li>Your executable (the compiler's output) is now called <code>hello</code>.</li>

<li>Check that by entering <code>hello</code> at the prompt. You should get your
output <code>Hello, world!</code> on the screen.</li>

<li><p>
Now open <code>hello.c</code> again using <code>notepad</code> and at the top add the line:
</p>
<pre class="example" id="orgbf78651">
// Hello world program by [yourname] (Pledged)
</pre></li>

<li>Save it again and submit it as your first in-class assignment:
<ol class="org-ol">
<li>Open a browser to GDrive and upload the file</li>
<li>Open the <a href="https://lyon.instructure.com/courses/2107/assignments/22790">assignment in Canvas</a> at lyon.instructure.com</li>
<li>Upload the file from GDrive (click on "<code>More</code>")</li>
<li>When you see it attached, click on <code>Submit Assignment</code>.</li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marcus Birkenkrahe</p>
<p class="date">Created: 2024-01-19 Fri 08:15</p>
</div>
</body>
</html>
